In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('./datas/test.csv')
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [4]:
str(1234567890)[-4:]

'7890'

In [5]:
def last_for(num):
  return str(num)[-4:]

In [6]:
last_for(1234556)

'4556'

In [9]:
df['last_for'] = df['Ticket'].apply(last_for)

In [10]:
df['Fare']

0        7.8292
1        7.0000
2        9.6875
3        8.6625
4       12.2875
         ...
413      8.0500
414    108.9000
415      7.2500
416      8.0500
417     22.3583
Name: Fare, Length: 418, dtype: float64

In [11]:
df.head(10)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,last_for
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,0911
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,3272
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,0276
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,5154
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,1298
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S,7538
6,898,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q,0972
7,899,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S,8738
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C,2657
9,901,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S,8871

In [12]:
df['Fare'].mean()

35.627188489208635

In [14]:
def yelp(price):
  if price < 10:
    return '$'
  elif price >= 10 and price < 30:
    return '$$'
  else:
    return '$$$'

In [16]:
df['yelp'] = df['Fare'].apply(yelp)

# Multiple Columns with apply methods

In [17]:
def simple(num):
  return num*2

In [18]:
simple(2)

4

In [20]:
simple2 = lambda num: num*2

In [21]:
simple2(2)

4

In [22]:
df['Fare'].apply(lambda num: num*2)

0       15.6584
1       14.0000
2       19.3750
3       17.3250
4       24.5750
         ...
413     16.1000
414    217.8000
415     14.5000
416     16.1000
417     44.7166
Name: Fare, Length: 418, dtype: float64

In [23]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,last_for,yelp
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,0911,$
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,3272,$
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,0276,$
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,5154,$
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,1298,$$

In [27]:
def farebyage(age, fare):
  if (fare/age) > 0.25:
    return "good"
  else:
    return "bad"

In [28]:
farebyage(10, 1000)

'good'

In [30]:
df['Fare by Age'] = df[['Age', 'Fare']].apply(lambda df: farebyage(df['Age'], df['Fare']), axis=1)

In [31]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,last_for,yelp,Fare by Age
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,0911,$,bad
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,3272,$,bad
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,0276,$,bad
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,5154,$,good
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,1298,$$,good

In [32]:
df.apply(lambda df: farebyage(df['Age'], df['Fare']), axis=1)

0       bad
1       bad
2       bad
3      good
4      good
       ...
413     bad
414    good
415     bad
416     bad
417     bad
Length: 418, dtype: object

In [33]:
# vectorize 이용 
df['Fare by Age'] = np.vectorize(farebyage)(df['Age'], df['Fare'])

In [34]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,last_for,yelp,Fare by Age
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,0911,$,bad
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,3272,$,bad
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,0276,$,bad
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,5154,$,good
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,1298,$$,good

In [35]:
import timeit

In [39]:
setup = """
import numpy as np
import pandas as pd
df = pd.read_csv('./datas/test.csv')
def farebyage(age, fare):
  if (fare/age) > 0.25:
    return "good"
  else:
    return "bad"
"""

In [40]:
stmt_one = """
df['Fare by Age'] = df[['Age', 'Fare']].apply(lambda df: farebyage(df['Age'], df['Fare']), axis=1)
"""

In [47]:
stmt_two = """
df['Fare by Age'] = np.vectorize(farebyage)(df['Age'], df['Fare'])
"""

In [44]:
timeit.timeit(setup=setup, stmt=stmt_one, number=1000)

5.684963840999899

In [48]:
timeit.timeit(setup=setup, stmt=stmt_two, number=1000)

0.4723828290000256